import { getInfoTool } from "./CSVParser.js";

const rawCitiesData = `44.38,34.33,Алушта,31440,
49.46,30.17,Біла Церква,200131,
49.54,28.49,Бердичів,87575,#некомент

#
46.49,36.58,#Бердянськ,121692,
49.15,28.41,Вінниця,356665,
#45.40,34.29,Джанкой,43343,

# в цьому файлі три рядки-коментарі :)`;

const text = `В Україні є кілька міст, які мають велике значення. Одним із таких є Вінниця, розташована в центральній частині країни. Місто славиться своєю архітектурною спадщиною та культурним життям. Поряд з Вінницею є також Біла Церква, яка відома своєю історією та культурою. Місто стало важливим економічним і промисловим центром.
Західніше від столиці Київ знаходиться Бердичів, яке завжди привертало увагу туристів завдяки своїм унікальним архітектурним пам'яткам і місцевим святам. Бердичів — важливе місто для розвитку промисловості, а його населення налічує десятки тисяч людей.
На південному узбережжі Криму знаходиться курортне місто Алушта, відоме своїм сприятливим кліматом і численними туристами. Влітку місто наповнюється відпочиваючими, що обирають Алушту для літнього відпочинку.
Не можна забути й про Бердянськ, портове місто на Азовському морі, яке має не тільки економічне значення, а й величезний туристичний потенціал. Це місто неодноразово ставало популярним завдяки своїм пляжам та розвиненій інфраструктурі.`;

const infotool = getInfoTool(rawCitiesData);

console.log(infotool(text));